app/controllers/entries_controller.rb

SELECT  "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
---
  def show
    @entry = Entry.find_by_id(params[:id])