app/controllers/feeds_controller.rb

  def index
    @feeds = Feed.all
---
SELECT "feeds".* FROM "feeds"

  def load_entries
    @entries ||= Entry.all
---
SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = ?  [["feed_id", 1]]

  def show
    @entry = Entry.new
    @feed = Feed.find(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @feed = Feed.new(feed_params)
    require 'rss'

    urlentite = feed_params[:url]
    puts "ceci est le lien ",urlentite




    respond_to do |format|
      if @feed.save
        format.html { redirect_to :controller => 'entries', :action => 'index' , notice: 'Feed was successfully created.' }
        format.json { render :show, status: :created, location: @feed }
      else
        format.html { render :new }
        format.json { render json: @feed.errors, status: :unprocessable_entity }
      end
    end

    puts "ceci est le feed ID",@feed.id
    rss = RSS::Parser.parse(urlentite,false)
    rss.items.each do |item|
      puts "ceci est item title ",item.title
      @entry = Entry.new
      @entry.title = item.title
      @entry.content = item.description
      @entry.feed_id = @feed.id
      @entry.pulished = item.date
      @entry.url = item.link
      @entry.save
---
INSERT INTO "feeds" ("name", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "hello"], ["url", "http://feeds.washingtonpost.com/rss/rss_reliable-source"], ["created_at", "2018-02-22 12:23:04.970754"], ["updated_at", "2018-02-22 12:23:04.970754"]]
INSERT INTO "entries" ("title", "pulished", "content", "url", "feed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @feed.destroy
---
DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 1]]

    def set_feed
      @feed = Feed.find(params[:id])
---
SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]